'''
w1020
系級 :資管三A
學號 :408630852
姓名 :施睿宗
PS.請將此檔名更改為學號.py
'''

'''
#台北捷運1996開始營運，在發展過程中紅線的站別多次調整，
#old_red為前期營運的站名列表，請依照題目要求完成各項調整。
'''

#  Q1:阿成在考古時發現old_red中的北投出現了兩次，查證後，
#     依序應為[復興崗、新北投、北投、唭哩岸...]請協助為調整正確站名後印出完整old_red串列
#  tip : 串列名稱[index] = 元素內容 ，可以調整修改指定位置的資料內容。
old_red = ["淡水","紅樹林","竹圍","關渡","忠義","復興崗","北投","北投","奇岩","唭哩岸","石牌","明德","芝山","士林","劍潭","圓山","民權西路","雙連","中山","台北車站","台大醫院","中正紀念堂","古亭","頂溪","永安市場","南勢角"]

old_red[6] = "新北投"
print(old_red)
#  Q2: 又發現old_red最後的永安市場與南勢角中間少了一站景安，請協助將景安插入到正確位置並印出old_red串列  
#  Tip : 可參考使用inset 
#   輸出:
#        ["淡水","紅樹林","竹圍","關渡","忠義","復興崗","北投","北投","奇岩","唭哩岸","石牌","明德","芝山","士林","劍潭","圓山","民權西路","雙連","中山","台北車站","台大醫院","中正紀念堂","古亭","頂溪","永安市場","景安","南勢角"]

old_red.insert(len(old_red)-1, "景安")
print(old_red)
#  Q3 : addNew 為後續調整的紅線站名，請將其串接到half_red後面，完成目前最新的紅線捷運站列表
#  輸出 :
#       ["淡水","紅樹林","竹圍","關渡","忠義","復興崗","新北投","北投","奇岩","唭哩岸","石牌","明德","芝山","士林","劍潭","圓山","民權西路","雙連","中山","台北車站","台大醫院","中正紀念堂","東門","大安森林公園","大安","後山埤","信義安和","台北101/世貿","象山"]

half_red = ["淡水","紅樹林","竹圍","關渡","忠義","復興崗","新北投","北投","奇岩","唭哩岸","石牌","明德","芝山","士林","劍潭","圓山","民權西路","雙連","中山","台北車站","台大醫院","中正紀念堂"]
addNew = ["東門","大安森林公園","大安","後山埤","信義安和","台北101/世貿","象山"]

half_red.extend(addNew)
print(half_red)
# Q4-1: 呈Q3，長官檢核後，發現後山埤不應該在紅線中。請協助移除後山埤並印出最終的結果
# 輸出 :
#        ["淡水","紅樹林","竹圍","關渡","忠義","復興崗","新北投","北投","奇岩","唭哩岸","石牌","明德","芝山","士林","劍潭","圓山","民權西路","雙連","中山","台北車站","台大醫院","中正紀念堂","東門","大安森林公園","大安","信義安和","台北101/世貿","象山"]

half_red.remove("後山埤")
print(half_red)
# Q4-2 請問紅線總共有幾站
# 輸出 :
#       紅線總共有N站

print("紅線總共有%s站" % len(half_red))
#  根據統計，紅線行駛每站間隔為2.5分鐘，遊客自淡水出發:

full_red = ["淡水","紅樹林","竹圍","關渡","忠義","復興崗","新北投","北投","奇岩","唭哩岸","石牌","明德","芝山","士林","劍潭","圓山","民權西路","雙連","中山","台北車站","台大醫院","中正紀念堂","東門","大安森林公園","大安","信義安和","台北101/世貿","象山"]

# Q5-1  請依據full_red的車站順序，若遊客在台北車站下車，所問需要花費的乘車時間。
# 輸出 :
#       乘車時間為47.5分鐘

print("乘車時間為%.1f分鐘" % (float(full_red.index("台北車站"))*2.5))
# Q5-2  請依據full_red的車站順序，讓遊客輸入下車站索引編號，計算需要花費的乘車時間。
# 作答範例 :
# 輸入 :
#       請輸入迄站索引編號 : 4 
# 輸出 :
#       自淡水站至{忠義站}所需時間為:10分鐘 
# tip : 忠義為變數帶出。 

num = int(input("請輸入迄站索引編號 : "))
name = full_red[num]
print("自淡水站至{%s站}所需時間為:%.0f分鐘" % (name, float(num)*2.5))

# Q6 進階加分題，讓使用者輸入起訖站名，計算所需時間  
# 
# 輸入 :
#       請輸入起站 : 淡水
#       請輸入迄站 : 忠義
# 輸出 :
#       自淡水站至{忠義站}所需時間為:10分鐘 

# tip :
#       可參考使用 list.index(元素)取得元素的索引位置
#       可參考abs功能

location1 = str(input("請輸入起站 : "))
location2 = str(input("請輸入迄站 : "))

dis = abs(full_red.index(location1) - full_red.index(location2))
print("自%s站至{%s站}所需時間為:%.0f分鐘" % (location1, location2, float(dis)*2.5))
