"""
銘傳大學(MCU)的資訊建立
	      中文名稱:銘傳大學,
      	電話: (03)3507001,
       	統編:29902801,
       	系所:統計系、經濟系
"""
## Q:建立MCU dict
MCU = {"中文名稱": "銘傳大學", "電話": "(03)3507001", "統編": "29902801", "系所": [
    "統計系", "經濟系"]}

## Q:查詢統編
print(MCU["統編"])

# Q:查找練習
print(MCU.keys())
print(MCU.values())
print(MCU.items())

# Q:新增元素 傳真:(02)28810521
MCU["傳真"]="(02)28810521"
print(MCU)

# Q:新增多筆元素  renew_data到 MCU BY update
renew_data = {"成立日期": "1988-11-23",
              "地址": "桃園市龜山區大同里德明路5號", "分校": ["基河校區", "金門校區"]}
MCU.update(renew_data)
print(MCU)
 
# Q:移除元素練習 del dict[keyname] or pop(keyname)
del MCU["中文名稱"]
# MCU.pop("中文名稱")
print(MCU)

# Q:list+dict 綜合練習
tick = [{"s": "2330.tw", "dwm": "2019-10-15", "h": "240", "v": 29179, "c": "239.5", "o": "240", "l": "236.5"},
        {"s": "2330.tw", "dwm": "2019-10-16", "h": "249", "v": 27562, "c": "236", "o": "235", "l": "231"}]
'''
1.請印出tick中兩筆資料的日期
2.請產生一個串列close將兩個收盤價放入
3.請印出close中最後一筆收盤價
'''
for i in tick:
	print(i["dwm"])

close = [tick[0]["c"],tick[1]["c"]]

print(close[-1:])
'''
讓使用者可以用輸入的查詢物品的屬性名稱 
將查到的內容回饋給使用者
'''
Mask={'代碼':'5932077467','名稱':'維康藥局','地址':'桃園市龜山區復興一路８８號１樓','電話':'(03)3283880','成人口罩':'54','兒童口罩':'1293','來源資料時間':'2021/10/11 11:50:43'}



'''
# 自製一個fruit字典，建立三個屬性(name,loction,season)並印出 (Before:fruits內容)
# 讓使用者輸入key後可以印出查詢的結果(使用input、print)，例如 :  使用者輸入查詢location，回傳青森
# 添加fruit一個key值- unit，存放購買單位(EX: 葡萄為串，蘋果為顆)
# 印出修改後的fruit (after:fruit內容)
'''

